---
kind: type
id: T:Autodesk.Revit.DB.Path3d
source: html/459b6d79-a4e7-06f5-ab30-4ec8cffab15b.htm
---
# Autodesk.Revit.DB.Path3d

Provides access to the Generic 3D path object in Autodesk Revit.

## Syntax (C#)
```csharp
public class Path3d : SketchBase
```

## Remarks
This object represents a 3D path sketch of Sweep.